ipv6 = {
            "Germany 🇩🇪": "de",
            "Netherlands 🇳🇱": "nl",
            "United Kingdom 🇬🇧": "gb",
            "Canada 🇨🇦": "ca",
            "Russia 🇷🇺": "ru",
            "Usa 🇺🇸": "us",
            "France 🇫🇷": "fr",
            "Singapore 🇸🇬": "sg",
            "Japan 🇯🇵": "jp"
        }



ipv4 = {
            "Russia 🇷🇺": "ru",
            "Portugal 🇵🇹": "pt",
            "Philippines 🇵🇭": "ph",
            "Ukraine 🇺🇦": "ua",
            "Austria 🇦🇹": "at",
            "Lithuania 🇱🇹": "lt",
            "France 🇫🇷": "fr",
            "Czechia 🇨🇿": "cz",
            "Greece 🇬🇷": "gr",
            "Denmark 🇩🇰": "dk",
            "Egypt 🇪🇬": "eg",
            "Slovenia 🇸🇮": "si",
            "Italy 🇮🇹": "it",
            "Serbia 🇷🇸": "rs",
            "Switzerland 🇨🇭": "ch",
            "Japan 🇯🇵": "jp",
            "Spain 🇪🇸": "es",
            "Usa 🇺🇸": "us",
            "Norway 🇳🇴": "no",
            "Indonesia 🇮🇩": "id",
            "Bulgaria 🇧🇬": "bg",
            "Kyrgyzstan 🇰🇬": "kg",
            "United Kingdom 🇬🇧": "gb",
            "Chile 🇨🇱": "cl",
            "South Africa 🇿🇦": "za",
            "Finland 🇫🇮": "fi",
            "Kazakhstan 🇰🇿": "kz",
            "Brazil 🇧🇷": "br",
            "Australia 🇦🇺": "au",
            "Morocco 🇲🇦": "ma",
            "Turkmenistan 🇹🇲": "tm",
            "Bangladesh 🇧🇩": "bd",
            "Estonia 🇪🇪": "ee",
            "Netherlands 🇳🇱": "nl",
            "Israel 🇮🇱": "il",
            "South Korea 🇰🇷": "kr",
            "Malaysia 🇲🇾": "my",
            "Canada 🇨🇦": "ca",
            "Uae 🇦🇪": "ae",
            "Vietnam 🇻🇳": "vn",
            "Taiwan 🇹🇼": "tw",
            "Belgium 🇧🇪": "be",
            "Singapore 🇸🇬": "sg",
            "Hong Kong 🇭🇰": "hk",
            "Uzbekistan 🇺🇿": "uz",
            "Belarus 🇧🇾": "by",
            "Romania 🇷🇴": "ro",
            "Poland 🇵🇱": "pl",
            "Armenia 🇦🇲": "am",
            "Tajikistan 🇹🇯": "tj",
            "Sweden 🇸🇪": "se",
            "Turkey 🇹🇷": "tr",
            "Germany 🇩🇪": "de",
            "Latvia 🇱🇻": "lv",
            "Cyprus 🇨🇾": "cy",
        }



ipv4_cheep = {
            "Russia 🇷🇺": "Russia",
            "USA 🇺🇸": "USA",
            "Germany 🇩🇪": "Germany",
            "United Kingdom 🇬🇧": "Great Britan",
            "Netherlands 🇳🇱": "Netherlands",
            "Kazakhstan 🇰🇿": "Kazakhstan",
        }



proxy_info = {
            "ipv4 - http": """⚡️ <b>Вы выбрали IPv4 - HTTPS proxy</b>
➖➖➖➖➖
— <code>Поддержка IPv4 адресов</code>
— <code>Работает через безопасный HTTPS протокол</code>
— <code>Универсальный вариант для сайтов и приложений</code>
➖➖➖➖➖
ℹ️  <b>Если остались вопросы — обратитесь в «Тех Поддержку»</b>""",

    "ipv4 - socks": """⚡️  <b>Вы выбрали IPv4 - SOCKS5 proxy</b>
➖➖➖➖➖
— <code>Поддержка IPv4 адресов</code>
— <code>Полная анонимность и поддержка всех протоколов (TCP, UDP)</code>
— <code>Хорошо подходит для парсинга и обхода блокировок</code>
➖➖➖➖➖
ℹ️  <b>Если остались вопросы — обратитесь в «Тех Поддержку»</b>""",

    "ipv6 - http": """⚡️  <b>Вы выбрали IPv6 - HTTPS proxy</b>
➖➖➖➖➖
— <code>Поддержка IPv6 адресов</code>
— <code>Работает через защищённое HTTPS соединение</code>
— <code>Подходит для сайтов с поддержкой IPv6</code>
➖➖➖➖➖
ℹ️  <b>Если остались вопросы — обратитесь в «Тех Поддержку»</b>""",

    "ipv6 - socks": """⚡️  <b>Вы выбрали IPv6 - SOCKS5 proxy</b>
➖➖➖➖➖
— <code>Поддержка IPv6 адресов</code>
— <code>Максимальная анонимность, поддержка TCP и UDP</code>
— <code>Хорош для работы с сервисами, поддерживающими IPv6</code>
➖➖➖➖➖
ℹ️  <b>Если остались вопросы — обратитесь в «Тех Поддержку»</b>"""
        }